---
kind: property
id: P:Autodesk.Revit.DB.RevolvedSurface.Origin
zh: 原点
source: html/14bcd3af-0f67-8d52-e16d-74b7baf3e513.htm
---
# Autodesk.Revit.DB.RevolvedSurface.Origin Property

**中文**: 原点

Center of the circle that defines the base of the revolved surface. This is the origin of the local coordinate system associated with this revolved surface.

## Syntax (C#)
```csharp
public XYZ Origin { get; }
```